app/Controllers/Admins/Admins.php

    public function index() {

        $session = session();

        $countProduct = $this->db->table('products')->countAllResults();

        $countCategories = $this->db->table('categories')->countAllResults();

        $countOrders = $this->db->table('orders')->countAllResults();

        $countAdmins = $this->db->table('admins')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `products`
SELECT COUNT(*) AS `numrows`
FROM `categories`
SELECT COUNT(*) AS `numrows`
FROM `orders`
SELECT COUNT(*) AS `numrows`
FROM `admins`