app/Controllers/Products/Products.php

    public function addToCart()
    {
        $cart = new Cart;

        $product_id = $this->request->getPost('product_id');
        $data = [
            "product_id"    => $product_id,
            "user_id"       => auth()->user()->id,
            "qty"           => $this->request->getPost('qty'),
            "name"          => $this->request->getPost('name'),
            "price"         => $this->request->getPost('price'),
            "image"         => $this->request->getPost('image'),
            "subtotal"      => $this->request->getPost('price') * $this->request->getPost('qty')
        ];

        session()->setFlashdata('success', 'Product added to cart');
        $cart->save($data);
---
INSERT INTO `cart` (`product_id`, `user_id`, `qty`, `name`, `price`, `image`, `subtotal`) VALUES ('9', 1, '1', 'Tomates', '10', 'vegetables.jpg', 10)

    public function cart()
    {
        $user_id = auth()->user()->id;
        // displaying cart item
        $cartItem = $this->db->table('cart')->where('user_id', $user_id)->orderBy('created_at', 'desc')->get()->getResult();

        $totalPrice = $this->db->table('cart')->selectSum('subtotal', 'whole_price')->where('user_id', $user_id)->get()->getFirstRow();
---
SELECT *
FROM `cart`
WHERE `user_id` = 1
ORDER BY `created_at` DESC
SELECT SUM(`subtotal`) AS `whole_price`
FROM `cart`
WHERE `user_id` = 1

    public function checkout()
    {
        $session = session();

        // echo "Total" . $session->get('price');
        $user_id = auth()->user()->id;
        // displaying cart item
        $cartItem = $this->db->table('cart')->where('user_id', $user_id)->orderBy('created_at', 'desc')->get()->getResult();

        $subtotalPrice = $this->db->table('cart')->selectSum('subtotal', 'whole_price')->where('user_id', $user_id)->get()->getFirstRow();
---
SELECT *
FROM `cart`
WHERE `user_id` = 1
ORDER BY `created_at` DESC
SELECT SUM(`subtotal`) AS `whole_price`
FROM `cart`
WHERE `user_id` = 1

    public function success()
    {
        $id = auth()->user()->id;
        $deleteProductsFromCart = $this->db->table('cart')->where('user_id', $id)->delete();
---
DELETE FROM `cart`
WHERE `user_id` = 1