app/Controllers/Products/Products.php

INSERT INTO `cart` (`product_id`, `user_id`, `qty`, `name`, `price`, `image`) VALUES ('10', 1, '5', 'Nugget', 50, 'fruits.jpg')
---
    public function addToCart()
    {
        $cart = new Cart;

        $product_id = $this->request->getPost('product_id');
        $data = [
            "product_id"    => $product_id,
            "user_id"       => auth()->user()->id,
            "qty"           => $this->request->getPost('qty'),
            "name"          => $this->request->getPost('name'),
            "price"         => $this->request->getPost('price'),
            "image"         => $this->request->getPost('image'),
            "subtotal"      => $this->request->getPost('price') * $this->request->getPost('qty')
        ];

        session()->setFlashdata('success', 'Product added to cart');
        $cart->save($data);