app/Controllers/Users/UsersInfo.php

SELECT *
FROM `orders`
WHERE `user_id` = 1
ORDER BY `created_at` DESC
---
    public function userOrders()
    {
        $id = auth()->user()->id;

        $orders = $this->db->table('orders')->where('user_id', $id)->orderBy('created_at', 'desc')->get()->getResult();